{"backend": "tensorflow", "keras_version": "2.0.6", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["activation_109", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 713, 713, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1_1_3x3_s2", "config": {"filters": 64, "name": "conv1_1_3x3_s2", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [2, 2], "padding": "same", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1_1_3x3_s2", 0, 0, {}]]], "name": "conv1_1_3x3_s2_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1_1_3x3_s2_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv1_1_3x3_s2_bn", 0, 0, {}]]], "name": "activation_1", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv1_2_3x3", "config": {"filters": 64, "name": "conv1_2_3x3", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1_2_3x3", 0, 0, {}]]], "name": "conv1_2_3x3_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1_2_3x3_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv1_2_3x3_bn", 0, 0, {}]]], "name": "activation_2", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv1_3_3x3", "config": {"filters": 128, "name": "conv1_3_3x3", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1_3_3x3", 0, 0, {}]]], "name": "conv1_3_3x3_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1_3_3x3_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv1_3_3x3_bn", 0, 0, {}]]], "name": "activation_3", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "max_pooling2d_1", "config": {"pool_size": [3, 3], "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "same", "trainable": true, "strides": [2, 2]}}, {"class_name": "Activation", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "activation_4", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2_1_1x1_reduce", "config": {"filters": 64, "name": "conv2_1_1x1_reduce", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_1_1x1_reduce", 0, 0, {}]]], "name": "conv2_1_1x1_reduce_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_1_1x1_reduce_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv2_1_1x1_reduce_bn", 0, 0, {}]]], "name": "activation_5", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "zero_padding2d_1", "config": {"padding": [[1, 1], [1, 1]], "name": "zero_padding2d_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "name": "conv2_1_3x3", "config": {"filters": 64, "name": "conv2_1_3x3", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_1_3x3", 0, 0, {}]]], "name": "conv2_1_3x3_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_1_3x3_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv2_1_3x3_bn", 0, 0, {}]]], "name": "activation_6", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "conv2_1_1x1_increase", "config": {"filters": 256, "name": "conv2_1_1x1_increase", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2_1_1x1_proj", "config": {"filters": 256, "name": "conv2_1_1x1_proj", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_1_1x1_increase", 0, 0, {}]]], "name": "conv2_1_1x1_increase_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_1_1x1_increase_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_1_1x1_proj", 0, 0, {}]]], "name": "conv2_1_1x1_proj_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_1_1x1_proj_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["conv2_1_1x1_increase_bn", 0, 0, {}], ["conv2_1_1x1_proj_bn", 0, 0, {}]]], "name": "add_1", "config": {"name": "add_1", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_7", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2_2_1x1_reduce", "config": {"filters": 64, "name": "conv2_2_1x1_reduce", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_2_1x1_reduce", 0, 0, {}]]], "name": "conv2_2_1x1_reduce_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_2_1x1_reduce_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv2_2_1x1_reduce_bn", 0, 0, {}]]], "name": "activation_8", "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "zero_padding2d_2", "config": {"padding": [[1, 1], [1, 1]], "name": "zero_padding2d_2", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]], "name": "conv2_2_3x3", "config": {"filters": 64, "name": "conv2_2_3x3", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_2_3x3", 0, 0, {}]]], "name": "conv2_2_3x3_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_2_3x3_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv2_2_3x3_bn", 0, 0, {}]]], "name": "activation_9", "config": {"activation": "relu", "name": "activation_9", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2_2_1x1_increase", "config": {"filters": 256, "name": "conv2_2_1x1_increase", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_2_1x1_increase", 0, 0, {}]]], "name": "conv2_2_1x1_increase_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_2_1x1_increase_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["conv2_2_1x1_increase_bn", 0, 0, {}], ["activation_7", 0, 0, {}]]], "name": "add_2", "config": {"name": "add_2", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_10", "config": {"activation": "relu", "name": "activation_10", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "conv2_3_1x1_reduce", "config": {"filters": 64, "name": "conv2_3_1x1_reduce", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_3_1x1_reduce", 0, 0, {}]]], "name": "conv2_3_1x1_reduce_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_3_1x1_reduce_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv2_3_1x1_reduce_bn", 0, 0, {}]]], "name": "activation_11", "config": {"activation": "relu", "name": "activation_11", "trainable": true}}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "zero_padding2d_3", "config": {"padding": [[1, 1], [1, 1]], "name": "zero_padding2d_3", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "name": "conv2_3_3x3", "config": {"filters": 64, "name": "conv2_3_3x3", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_3_3x3", 0, 0, {}]]], "name": "conv2_3_3x3_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_3_3x3_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv2_3_3x3_bn", 0, 0, {}]]], "name": "activation_12", "config": {"activation": "relu", "name": "activation_12", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "conv2_3_1x1_increase", "config": {"filters": 256, "name": "conv2_3_1x1_increase", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_3_1x1_increase", 0, 0, {}]]], "name": "conv2_3_1x1_increase_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_3_1x1_increase_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["conv2_3_1x1_increase_bn", 0, 0, {}], ["activation_10", 0, 0, {}]]], "name": "add_3", "config": {"name": "add_3", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_13", "config": {"activation": "relu", "name": "activation_13", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv3_1_1x1_reduce", "config": {"filters": 128, "name": "conv3_1_1x1_reduce", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [2, 2], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_1_1x1_reduce", 0, 0, {}]]], "name": "conv3_1_1x1_reduce_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_1_1x1_reduce_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_1_1x1_reduce_bn", 0, 0, {}]]], "name": "activation_14", "config": {"activation": "relu", "name": "activation_14", "trainable": true}}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "zero_padding2d_4", "config": {"padding": [[1, 1], [1, 1]], "name": "zero_padding2d_4", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]], "name": "conv3_1_3x3", "config": {"filters": 128, "name": "conv3_1_3x3", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_1_3x3", 0, 0, {}]]], "name": "conv3_1_3x3_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_1_3x3_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_1_3x3_bn", 0, 0, {}]]], "name": "activation_15", "config": {"activation": "relu", "name": "activation_15", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "conv3_1_1x1_increase", "config": {"filters": 512, "name": "conv3_1_1x1_increase", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv3_1_1x1_proj", "config": {"filters": 512, "name": "conv3_1_1x1_proj", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [2, 2], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_1_1x1_increase", 0, 0, {}]]], "name": "conv3_1_1x1_increase_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_1_1x1_increase_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_1_1x1_proj", 0, 0, {}]]], "name": "conv3_1_1x1_proj_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_1_1x1_proj_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["conv3_1_1x1_increase_bn", 0, 0, {}], ["conv3_1_1x1_proj_bn", 0, 0, {}]]], "name": "add_4", "config": {"name": "add_4", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_16", "config": {"activation": "relu", "name": "activation_16", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv3_2_1x1_reduce", "config": {"filters": 128, "name": "conv3_2_1x1_reduce", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_2_1x1_reduce", 0, 0, {}]]], "name": "conv3_2_1x1_reduce_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_2_1x1_reduce_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_2_1x1_reduce_bn", 0, 0, {}]]], "name": "activation_17", "config": {"activation": "relu", "name": "activation_17", "trainable": true}}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "zero_padding2d_5", "config": {"padding": [[1, 1], [1, 1]], "name": "zero_padding2d_5", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]], "name": "conv3_2_3x3", "config": {"filters": 128, "name": "conv3_2_3x3", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_2_3x3", 0, 0, {}]]], "name": "conv3_2_3x3_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_2_3x3_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_2_3x3_bn", 0, 0, {}]]], "name": "activation_18", "config": {"activation": "relu", "name": "activation_18", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "conv3_2_1x1_increase", "config": {"filters": 512, "name": "conv3_2_1x1_increase", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_2_1x1_increase", 0, 0, {}]]], "name": "conv3_2_1x1_increase_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_2_1x1_increase_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["conv3_2_1x1_increase_bn", 0, 0, {}], ["activation_16", 0, 0, {}]]], "name": "add_5", "config": {"name": "add_5", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_19", "config": {"activation": "relu", "name": "activation_19", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "conv3_3_1x1_reduce", "config": {"filters": 128, "name": "conv3_3_1x1_reduce", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_3_1x1_reduce", 0, 0, {}]]], "name": "conv3_3_1x1_reduce_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_3_1x1_reduce_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_3_1x1_reduce_bn", 0, 0, {}]]], "name": "activation_20", "config": {"activation": "relu", "name": "activation_20", "trainable": true}}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "zero_padding2d_6", "config": {"padding": [[1, 1], [1, 1]], "name": "zero_padding2d_6", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]], "name": "conv3_3_3x3", "config": {"filters": 128, "name": "conv3_3_3x3", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_3_3x3", 0, 0, {}]]], "name": "conv3_3_3x3_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_3_3x3_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_3_3x3_bn", 0, 0, {}]]], "name": "activation_21", "config": {"activation": "relu", "name": "activation_21", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "conv3_3_1x1_increase", "config": {"filters": 512, "name": "conv3_3_1x1_increase", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_3_1x1_increase", 0, 0, {}]]], "name": "conv3_3_1x1_increase_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_3_1x1_increase_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["conv3_3_1x1_increase_bn", 0, 0, {}], ["activation_19", 0, 0, {}]]], "name": "add_6", "config": {"name": "add_6", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_22", "config": {"activation": "relu", "name": "activation_22", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "conv3_4_1x1_reduce", "config": {"filters": 128, "name": "conv3_4_1x1_reduce", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_4_1x1_reduce", 0, 0, {}]]], "name": "conv3_4_1x1_reduce_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_4_1x1_reduce_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_4_1x1_reduce_bn", 0, 0, {}]]], "name": "activation_23", "config": {"activation": "relu", "name": "activation_23", "trainable": true}}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "zero_padding2d_7", "config": {"padding": [[1, 1], [1, 1]], "name": "zero_padding2d_7", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]], "name": "conv3_4_3x3", "config": {"filters": 128, "name": "conv3_4_3x3", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_4_3x3", 0, 0, {}]]], "name": "conv3_4_3x3_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_4_3x3_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_4_3x3_bn", 0, 0, {}]]], "name": "activation_24", "config": {"activation": "relu", "name": "activation_24", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "conv3_4_1x1_increase", "config": {"filters": 512, "name": "conv3_4_1x1_increase", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_4_1x1_increase", 0, 0, {}]]], "name": "conv3_4_1x1_increase_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_4_1x1_increase_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["conv3_4_1x1_increase_bn", 0, 0, {}], ["activation_22", 0, 0, {}]]], "name": "add_7", "config": {"name": "add_7", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "activation_25", "config": {"activation": "relu", "name": "activation_25", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "name": "conv4_1_1x1_reduce", "config": {"filters": 256, "name": "conv4_1_1x1_reduce", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv4_1_1x1_reduce", 0, 0, {}]]], "name": "conv4_1_1x1_reduce_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv4_1_1x1_reduce_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv4_1_1x1_reduce_bn", 0, 0, {}]]], "name": "activation_26", "config": {"activation": "relu", "name": "activation_26", "trainable": true}}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "name": "zero_padding2d_8", "config": {"padding": [[2, 2], [2, 2]], "name": "zero_padding2d_8", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]], "name": "conv4_1_3x3", "config": {"filters": 256, "name": "conv4_1_3x3", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [2, 2], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv4_1_3x3", 0, 0, {}]]], "name": "conv4_1_3x3_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv4_1_3x3_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv4_1_3x3_bn", 0, 0, {}]]], "name": "activation_27", "config": {"activation": "relu", "name": "activation_27", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_27", 0, 0, {}]]], "name": "conv4_1_1x1_increase", "config": {"filters": 1024, "name": "conv4_1_1x1_increase", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "name": "conv4_1_1x1_proj", "config": {"filters": 1024, "name": "conv4_1_1x1_proj", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv4_1_1x1_increase", 0, 0, {}]]], "name": "conv4_1_1x1_increase_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv4_1_1x1_increase_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv4_1_1x1_proj", 0, 0, {}]]], "name": "conv4_1_1x1_proj_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv4_1_1x1_proj_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["conv4_1_1x1_increase_bn", 0, 0, {}], ["conv4_1_1x1_proj_bn", 0, 0, {}]]], "name": "add_8", "config": {"name": "add_8", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "activation_28", "config": {"activation": "relu", "name": "activation_28", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "name": "conv4_2_1x1_reduce", "config": {"filters": 256, "name": "conv4_2_1x1_reduce", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv4_2_1x1_reduce", 0, 0, {}]]], "name": "conv4_2_1x1_reduce_bn", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv4_2_1x1_reduce_bn", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "epsilon": 1e-05, "momentum": 0.95, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "axis": -1, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["conv4_2_1x1_reduce_bn", 0, 0, {}]]], "name": "activation_29", "config": {"activation": "relu", "name": "activation_29", "trainable": true}}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "name": "zero_padding2d_9", "config": {"padding": [[2, 2], [2, 2]], "name": "zero_padding2d_9", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]], "name": "conv4_2_3x3", "config": {"filters": 256, "name": "conv4_2_3x3", "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [2, 2], "use_bias": false, "kernel_constraint": null, 